/*371. 两整数之和*/

/*不使用运算符 + 和 - ​​​​​​​，计算两整数 ​​​​​​​a 、b ​​​​​​​之和。

示例 1:

输入: a = 1, b = 2
输出: 3
示例 2:

输入: a = -2, b = 3
输出: 1
*/

var getSum = function(a, b) {
    var sum,carry;
    //加法是异或运算 + 进位值
    /*
     0 0 0 1 (1)
     0 0 1 0 (2)
     -------
     0 0 1 1 (3)
    */
    sum = a ^ b;
    /*
     0 0 0 1 (1)
     0 0 1 1 (3)
     -------
     0 0 1 0 (2)
     有一个进位，但这个进位应该前进一位 << 1
    */
    carry = (a & b) << 1;
    //进位不等于0， 就要把进位加上去
    if(carry != 0)
        return getSum(sum,carry);
    //进位等于0，输出答案
    return sum;
};